import Navbare from "../../navbar/navbar";
import Bootomnav from "../bottomnav.js/bottomnav";
import Header from "../header/header";
import { SiGnuprivacyguard } from "react-icons/si";
import { HiQuestionMarkCircle } from "react-icons/hi";
import { useDispatch, useSelector } from "react-redux";
import Deleinput from "../../redux/dateinput";
import ChangeBackInput from "../../redux/chnageInput";
import HeaderIcon from "../header/header-icon";
import Header2 from "../header/Header2";
import Fixphone from "../fixphone";
import Delebottnav from "../../redux/deletebottnav";

const Privacy = () => {
  const dis = useDispatch();
  const back = useSelector((state) => state.ChageInput.Background);
  const filter = useSelector((state) => state.ChageInput.filter);
  const dispatch = () => {
    dis(Deleinput.actions.deleinput());
    dis(ChangeBackInput.actions.Back());
    dis(Delebottnav.actions.deletebot());

  };
  return (
    <>
      <div>
      <HeaderIcon/>
      <Header2/>
        <Header />
        <Navbare />
        <Bootomnav />
        <Fixphone/>
        <div
          style={{ background: back, filter: filter }}
          onClick={dispatch}
          className="Privacy"
        >
          <div>
            <SiGnuprivacyguard style={{ fontSize: "25px", color: "red" }} />
          </div>
          <h1>حریم خصوصی</h1>
          <p>
            دیجی‌کالا با تاکید بر احترامی که برای حریم شخصی کاربران قائل است،
            برای خرید، ثبت نظر یا استفاده از برخی امکانات وب‌سایت اطلاعاتی را از
            کاربران درخواست می‌کند تا بتواند خدماتی امن و مطمئن را به کاربران
            ارائه دهد. برای پردازش و ارسال سفارش، اطلاعاتی مانند آدرس، شماره
            تلفن و ایمیل مورد نیاز است و از آنجا که کلیه فعالیت‌های دیجی‌کالا
            قانونی و مبتنی بر قوانین تجارت الکترونیک صورت می‌گیرد و طی فرایند
            خرید، فاکتور رسمی و بنا به درخواست مشتریان حقوقی گواهی ارزش افزوده
            صادر می‌شود، از این رو وارد کردن اطلاعاتی مانند نام و کد ملی برای
            اشخاص حقیقی یا کد اقتصادی و شناسه ملی برای خریدهای سازمانی لازم است.
            یادآوری می‌شود آدرس ایمیل و تلفن‌هایی که مشتری در پروفایل خود ثبت
            می‌کند، تنها آدرس ایمیل و تلفن‌های رسمی و مورد تایید مشتری است و
            تمام مکاتبات و پاسخ‌های شرکت از طریق آنها صورت می‌گیرد.
          </p>
          <p>
            بنابراین درج آدرس، ایمیل و شماره تماس‌های همراه و ثابت توسط مشتری،
            به منزله مورد تایید بودن صحت آنها است و در صورتی که موارد فوق به
            صورت صحیح یا کامل درج نشده باشد، دیجی‌کالا جهت اطمینان از صحت و
            قطعیت ثبت سفارش می‌تواند از مشتری، اطلاعات تکمیلی و بیشتری درخواست
            کند.
          </p>
          <p>
            مشتریان می‌توانند نام، آدرس و تلفن شخص دیگری را برای تحویل گرفتن
            سفارش وارد کنند و دیجی‌کالا تنها برای ارسال همان سفارش، از این
            اطلاعات استفاده خواهد کرد.
          </p>
          <p>
            همچنین دیجی کالا با نصب و یا استفاده از اپلیکشن با اخذ اجازه از
            کاربر اطلاعات زیر را به صورت ناشناس از کاربر اخذ می کند. این اطلاعات
            در حد ضرورت و متناسب با مقاصدی از جمله مطالعه علت گزارش خطا و بهبود
            اشکالات سیستمی و تجربه کاربری در هنگام استفاده از وبسایت و اپلیکیشن
            دیجی کالا و نیز تحقیقات بازاریابی و ارائه خدمات و پیشنهادات خرید
            مرتبط تر به کاربران جمع آوری می شود و به نحوی مورد استفاده قرار
            می‌گیرند که به طور مستقیم به یک شخص حقیقی مشخص و معین مرتبط نباشند.
          </p>
          <p>
            {" "}
            نوع دستگاه، زبان و نوع سیستم عامل دستگاه شما، شناسه اندروید و شناسه
            تبلیغاتی اندروید ویژه دستگاه شما، جست‌وجوهای انجام شده در وب سایت و
            اپلیکشن دیجی کالا و نتایج انتخاب‌شده، مدت و بازه های استفاده شما از
            دیجی کالا، برنامه های نصب شده، اطلاعات فنی و گزارش‌های سرور شامل نوع
            شبکه و نوع و نسخه مرورگر
          </p>
          <p>
            این اطلاعات تنها توسط دیجی کالا استفاده شده و در اختیار شریک تجاری
            دیگری قرار نمی گیرد. همچنین در صورت درخواست کاربر اطلاعات قبلی پاک
            شده و پس از آن این اطلاعات جمع آوری نمی گردد. در صورت بروز وقفه
            (Crashes) نیز اطلاعات زیر جهت مطالعه علت بروز وققه و رفع خطا جمع
            آوری می گردد:
          </p>
          <p>
            - وضعیت روت بودن یا نبودن دستگاه، میزان کل رم و میزان فضای پر آن
            هنگام وقفه، روز و ساعت رخدادها، خاموش یا روشن بودن شبکه بی‌سیم،
            خاموش یا روشن بودن شبکه دیتا، خاموش یا روشن بودن وضعیت رومینگ.
          </p>
          <p>
            دیجی کالا اطلاعات را توسط کوکی (cookie) جمع آوری می کند. کوکی فایلی
            است که به درخواست یک سایت، توسط مرورگر ایجاد می‌شود و به سایت امکان
            ذخیره بازدید‌های شما و مناسب‌سازی آنها را فراهم می‌نماید. بسیاری از
            مرورگرها امکان غیرفعال کردن کوکی را فراهم کرده‌اند، به این منظور
            می‌توانید راهنمای مرورگرها را مطالعه کنید.
          </p>
          <p>
            دیجی کالا برای اطلاع‌رسانی رویدادها و اخبار، خدمات و سرویس‌های ویژه
            یا پروموشن‌ها، برای اعضای وب‌سایت ایمیل یا پیامک ارسال نماید. در
            صورتی که کاربران تمایل به دریافت اینگونه ایمیل‌ها و پیامک‌ها نداشته
            باشند، می‌توانند عضویت دریافت خبرنامه دیجی‌کالا را در پروفایل خود
            لغو کنند. عدم اقدام جهت لغو، به منزله ی موافقت ضمنی با دریافت
            ایمیل‌ها و پیام‌ها و سلب حق اعتراض می‌باشد.
          </p>

          <p>
            <HiQuestionMarkCircle
              style={{
                background: "yellow",
                color: "black",
                borderRadius: "100%",
                fontSize: "24px",
              }}
            />{" "}
            <p style={{ color: "#F28213", marginBottom:'60px' }}>
              توجه داشته باشید که 300061930007، 3000619300، 1000619300، 1000012،
              1000013، 1000014، 1000020 و 50003101 شماره‌هایی است که دیجی‌کالا
              از طریق آن برای کاربران و مشتریان خود پیامک (اس‌ام‌اس) ارسال
              می‌کند. همچنین این شماره‌‌ها، سامانه ارسال پیامک است که وضعیت
              پردازش سفارش یا رویدادها، خدمات و سرویس‌های ویژه دیجی‌کالا را به
              اطلاع کاربران می‌رساند و روشن است که امکان دریافت پیام‌های شما از
              طریق آن وجود ندارد. همچنین ممکن است دیجی‌کالا از طریق شماره
              300061930002 برای برخی کاربران یا مشتریان خود، سوال نظرسنجی ارسال
              کند. بنابراین ارسال هرگونه پیامک تحت عنوان دیجی‌کالا، با هر شماره
              دیگری تخلف و سوء استفاده از نام دیجی‌کالا است و در صورت دریافت
              چنین پیامکی، لطفاً جهت پیگیری قانونی آن را
              بهInfo@digikala.comاطلاع دهید.
            </p>
          </p>
        </div>
      </div>
    </>
  );
};

export default Privacy;
