import Navbare from "../../navbar/navbar";
import Bootomnav from "../bottomnav.js/bottomnav";
import Header from "../header/header";
import { SlNotebook } from "react-icons/sl";
import { FaAngleUp } from "react-icons/fa";
import { FaAngleDown } from "react-icons/fa";
import { useState } from "react";
import Header2 from "../header/Header2";
import HeaderIcon from "../header/header-icon";
import { useDispatch, useSelector } from "react-redux";
import ChangeBackInput from "../../redux/chnageInput";
import Deleinput from "../../redux/dateinput";
import Fixphone from "../fixphone";
import Delebottnav from "../../redux/deletebottnav";

const Rules = () => {
  const [click, setclick] = useState(false);
  const [down, setdown] = useState(false);
  const [down1, setdown1] = useState(false);
  const [down2, setdown2] = useState(false);
  const dis = useDispatch();
  const back = useSelector((state) => state.ChageInput.Background);
  const filter = useSelector((state) => state.ChageInput.filter);
  const dispatch = () => {
    dis(Deleinput.actions.deleinput());
    dis(ChangeBackInput.actions.Back());
    dis(Delebottnav.actions.deletebot());

  };
  const touch = () => {
    setclick(!click);
  };
  const touchup = () => {
    setclick(!click);
  };
  const touch1 = () => {
    setdown(!down);
  };
  const touchup1 = () => {
    setdown(!down);
  };
  const touch2 = () => {
    setdown1(!down1);
  };
  const touchup2 = () => {
    setdown1(!down1);
  };
  const touch3 = () => {
    setdown2(!down2);
  };
  const touchup3 = () => {
    setdown2(!down2);
  };
  return (
    <>
      <HeaderIcon />
      <Header2 />
      <Header />
      <Navbare />
      <Bootomnav />
      <div
        className="Rules"
        onClick={dispatch}
        style={{ background: back, filter: filter }}
      >
        <div className="Rule">
          <SlNotebook className="Roule1" color="red" />
          <h1 className="Roulestext1">
            شرایط و قوانین استفاده از سرویس‌ها و خدمات دیجی‌کالا
          </h1>
          <p className="Roulestext2">
            کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات و
            برنامه‌‏های کاربردی دیجی‌کالا به دقت ملاحظه فرمایید.
          </p>
          <p className="Roulestext3">
            وب‏‌سایت دیجی‌کالا هنگام استفاده از پروفایل شخصی، طرح‏‌های تشویقی،
            ویدئوهای رسانه تصویری دیجی‌کالا و سایر خدمات ارائه شده توسط
            دیجی‌کالا به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه
            استفاده از سرویس‌‏ها و خدمات دیجی‌کالا است. توجه داشته باشید که ثبت
            سفارش نیز در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین
            دیجی‌کالا از سوی کاربر است. لازم به ذکر است شرایط و قوانین مندرج،
            جایگزین کلیه توافق‏‌های قبلی محسوب می‏‌شود.
          </p>

          <div>
            <div onClick={touch} className="RoulesT">
              <div
                style={{
                  fontSize: "20px",
                  display: "flex",
                  justifyContent: "space-between",
                }}
              >
                <span className="Rules2">قوانین عمومی</span>
                {!click ? (
                  <FaAngleUp onClick={touch} />
                ) : (
                  <FaAngleDown onClick={touchup} />
                )}
              </div>
              {click && (
                <p className="Roulestext3">
                  توجه داشته باشید کلیه اصول و رویه‏‌های دیجی‌کالا منطبق با
                  قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون
                  حمایت از حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت
                  قوانین مرتبط با کاربر است. در صورتی که در قوانین مندرج،
                  رویه‏‌ها و سرویس‏‌های دیجی‌کالا تغییراتی در آینده ایجاد شود،
                  در همین صفحه منتشر و به روز رسانی می شود و شما توافق می‏‌کنید
                  که استفاده مستمر شما از سایت به معنی پذیرش هرگونه تغییر است.
                </p>
              )}
              <hr />{" "}
            </div>{" "}
            <div onClick={touch1} className="RoulesT">
              <div
                style={{
                  fontSize: "20px",
                  display: "flex",
                  justifyContent: "space-between",
                }}
              >
                <span className="Rules2">تعریف مشتری یا کاربر </span>
                {!down ? (
                  <FaAngleUp onClick={touch1} />
                ) : (
                  <FaAngleDown onClick={touchup1} />
                )}
              </div>
              {down && (
                <p className="Roulestext3">
                  مشتری یا کاربر به شخصی گفته می‌شود که با اطلاعات کاربری خود که
                  در فرم ثبت‌نام درج کرده است، به ثبت سفارش یا هرگونه استفاده از
                  خدمات دیجی‌کالا اقدام کند. همچنین از آنجا که دیجی‌کالا یک
                  وب‌سایت خرده‌فروشی آنلاین است، طبق قانون تجارت الکترونیک مشتری
                  یا مصرف کننده هر شخصی است که به منظوری جز تجارت یا شغل حرفه‌ای
                  به خرید کالا یا خدمات اقدام می‌کند.
                </p>
              )}
              <hr />{" "}
            </div>
            <div onClick={touch2} className="RoulesT">
              <div
                style={{
                  fontSize: "20px",
                  display: "flex",
                  justifyContent: "space-between",
                }}
              >
                <span className="Rules2">
                  {" "}
                  تعریف فروشنده و شرایط کالاهای فروشندگان
                </span>
                {!down1 ? (
                  <FaAngleUp onClick={touch2} />
                ) : (
                  <FaAngleDown onClick={touchup2} />
                )}
              </div>
              {down1 && (
                <p className="Roulestext3">
                  محصولات ارایه شده در وب‌سایت، یا توسط دیجی‌کالا از شرکت‌های
                  معتبر و واردکنندگان رسمی و قانونی خریداری و عرضه می‌شود و یا
                  برخی فروشندگان با دیجی‌کالا همکاری می‌کنند و محصولات خود را
                  به‌واسطه این فروشگاه اینترنتی، به صورت آنلاین به فروش
                  می‌رسانند. منظور از کالای فروشندگان، گروه دوم است و فروشنده،
                  شخصی حقیقی یا حقوقی است که محصول خود را در وب‌سایت دیجی‌کالا
                  عرضه کرده، به فروش می رساند. همچنین اعتبار فروشنده‌ها توسط
                  دیجی‌کالا بررسی و مدارک مورد نیاز از ایشان اخذ می‌شود. -
                  مسئولیت‌های مربوط به کیفیت، قیمت، محتوا، شرایط و همچنین خدمات
                  پس از فروش محصول بر عهده فروشندگان است. - فاکتور کالاهایی که
                  توسط فروشندگان در سایت عرضه می‌شود، در صورت درخواست خریدار
                  توسط فروشنده ارسال می‌شود. - خریداران حداکثر تا 2 روز بعد از
                  ثبت سفارش و قطعی شدن آن، فرصت دارند درخواست ارسال فاکتور را
                  ثبت کنند. - سفارش‌هایی که دارای حداقل یک کالا از فروشندگان
                  باشند و تا ساعت 16 هر روز کاری نهایی شوند ، حداقل 1 روز کاری
                  بعد (طبق زمان تحویل اعلام‌شده در سایت) در تهران و شهرستان‌ها،
                  ارسال خواهند شد. - 1 روز کاری فاصله زمانی تحویل برای کالاهای
                  فروشندگان، به معنای این است که در صورت خرید کالای فروشندگان ،
                  شروع پردازش سفارش حداکثر 1 روز پس از زمان سفارش‌گذاری در
                  دیجی‌کالا است. - منظور از ۱ روز کاری، زمان آماده‌سازی و ارسال
                  کالا به انبار دیجی‌کالا توسط فروشنده است، که امکان دارد این
                  زمان بسته به نوع کالا تغییر یابد. - در صورت بروز تاخیر در
                  پردازش سفارش شما، این موضوع از طریق پیامک به شما اطلاع رسانی
                  شده و دیجی­کالا تلاش خواهد کرد محصول/محصولات مورد نظر شما را
                  ظرف ۲۴ ساعت تامین کند، درصورت عدم تامین کالا بعد از ۲۴ ساعت،
                  اقلام در انتظار تامین سفارش شما بصورت سیستمی لغو خواهد شد. -
                  در شرایط خاص مثل فروش شگفت‌انگیز، احتمال لغو شدن سفارش مربوط
                  به محصولات فروشندگان به دلایلی مانند اتمام موجودی کالا وجود
                  دارد و دیجی‌کالا مجاز است بدون اطلاع قبلی نسبت به توقف
                  سفارش‌‏گیری جدید، اقدام و فروش را متوقف کند. - در صورتی‌که
                  دیجی‌کالا تخفیف به شرط خرید تا سقف خاصی را اعلام کرد (Discount
                  Voucher)، میزان خرید از کالاهای فروشندگان محاسبه نمی‌شود و این
                  کالاها مشمول استفاده از این تخفیف‌ها نمی‌شوند. - نحوه برگشت از
                  فروش کالاهای فروشندگان طبق رویه دیجی‌کالا است، با این تفاوت که
                  فروشنده مسئولیت هرگونه عدم مطابقت را به عهده می‌گیرد. - به
                  کالاهای فروشندگان تخفیف سازمانی تعلق نمی‌گیرد. - خدمات پس ‌از‌
                  فروش دیجی‌کالا تنها درصورتی درخواست مشتری مبنی بر بازگرداندن
                  کالای فروشندگان را می‌پذیرد که لیبل بارکد نارنجی رنگ که روی
                  کالا نصب شده است، جدا نشده باشد.
                </p>
              )}
              <hr />{" "}
            </div>
            <div onClick={touch3} className="RoulesT">
              <div
                style={{
                  fontSize: "20px",
                  display: "flex",
                  justifyContent: "space-between",
                }}
              >
                <span className="Rules2"> ارتباطات الکترونیکی</span>
                {!down2 ? (
                  <FaAngleUp onClick={touch3} />
                ) : (
                  <FaAngleDown onClick={touchup3} />
                )}
              </div>
              {down2 && (
                <p className="Roulestext3">
                  هنگامی که شما از سرویس‌‏ها و خدمات دیجی‌کالا استفاده می‏‌کنید،
                  سفارش اینترنتی خود را ثبت یا خرید می‏‌کنید و یا به دیجی‌کالا
                  ایمیل می‏‌زنید، این ارتباطات به صورت الکترونیکی انجام می‏‌شود
                  و در صورتی که درخواست شما با رعایت کلیه اصول و رویه‏‌ها باشد،
                  شما موافقت می‌‏کنید که دیجی‌کالا به صورت الکترونیکی (از طریق
                  پست الکترونیکی، سرویس پیام کوتاه و سایر سرویس‌های الکترونیکی)
                  به درخواست شما پاسخ دهد. همچنین آدرس ایمیل و تلفن‌هایی که
                  مشتری در پروفایل خود ثبت می‌کند، تنها آدرس ایمیل و تلفن‌های
                  رسمی و مورد تایید مشتری است و تمام مکاتبات و پاسخ‌های شرکت از
                  طریق آنها صورت می‌گیرد. جهت اطلاع‌رسانی رویدادها، خدمات و
                  سرویس‌های ویژه یا پروموشن‌ها، امکان دارد دیجی‌کالا برای اعضای
                  وب سایت ایمیل یا پیامک ارسال نماید. در صورتی که کاربران تمایل
                  به دریافت اینگونه ایمیل و پیامک‌ها نداشته باشند، می‌توانند
                  عضویت دریافت خبرنامه دیجی‌کالا را در پروفایل خود لغو کنند.
                  توجه داشته باشید که 300061930007، 300061930000، 1000619300 ،
                  100061930000 ، 50003103 ، 5000333 ، 50003619300 و
                  5000361930000 تنها شماره‌‌هایی است که دیجی‌کالا از طریق آن
                  برای کاربران و مشتریان خود پیامک (اس ام اس) ارسال می‌کند.
                  همچنین این شماره‌‌ها سامانه ارسال پیامک است که وضعیت پردازش
                  سفارش یا رویدادها، خدمات و سرویس‌های ویژه دیجی‌کالا را به
                  اطلاع کاربران می‌رساند و روشن است که امکان دریافت پیام‌های شما
                  از طریق آن وجود ندارد. همچنین ممکن است دیجی‌کالا از طریق شماره
                  300061930002 برای برخی کاربران یا مشتریان خود، سوال نظرسنجی
                  ارسال کند. بنابراین ارسال هرگونه پیامک تحت عنوان دیجی‌کالا، با
                  هر شماره دیگری تخلف و سوء استفاده از نام دیجی‌کالا است و در
                  صورت دریافت چنین پیامکی، لطفاً جهت پیگیری قانونی آن را به
                  Info@digikala.com اطلاع دهید.
                </p>
              )}
              <hr style={{ marginBottom: "100px" }} />{" "}
            </div>
          </div>
        </div>
      </div>
      <Fixphone />
    </>
  );
};

export default Rules;
